import com.sun.org.apache.xpath.internal.operations.String;

// 1. 클래스 생성
// 2. 생성자 생성
// 3. 직원 10 명의 배열 매서드 생성 배열에 10명이름지정하면 인덱스에 값이 들어가는데 연봉까지 두개가 들어갈 수있을까? ..
// 4. 10명의 배열에 랜덤값2400 ~ 3500 지정 하는 매서드 생성  -> (int)(Math.random()*1100+2400); 이렇게 랜덤값 뽑는거같은데 ..
// 5. 4번에서 나온 값에 1년마다 1% ~ 20% 연봉 인상 매서드 생성 -> 나온값에 * ((float)(Math.random()*20+1) / 100);
// 5-1 . 저런식으로 계산해서 변수에 담고 for문돌려서 10번 반복하면 될거같은데 .. 첫 시작을 어떻게 해야할지 막히니 생각나는대로 써봅니다 ..
// 6. 연별로 평균 연봉값계산 하는 매서드 생성  -> 위에서 10번 돌려 반복한 값을 sum에 담아서 더하고 MAX값으로나누기 하고 mean에 담아서 출력 ..
// gatter 생성 뭐 등등 많은데 위에 매서드 생성하다 막힐거같음 ..
// 사람 이름정하는 부분부터 막힘 .. 뭔가 배열로 10명의 이름을 넣으면 랜덤값을 넣을때  에러날꺼같고..

class Apple {
final int MAX = 10;
    int[] employee;
    int sum;
    int mean;
        public Apple(int empArr[]){



    }


}




public class Prob43 {
    public static void main(String[] args) {
        //랜덤 연봉 적용을 해보자
        //어떤 회사에 직원이 10명 있다.
        //10명의 이름은 적당히 지어주도록 한다.
        //이들의 시작 연봉은 2400 ~ 3500 으로 랜덤하게 지정한다.
        //또한 연봉 인상률은 1% ~ 20% 사이의 랜덤값을 가지게 한다.
        //10 년후의 각 직원들의 연봉을 출력하도록 프로그래밍해보자!
        //또한 연별로 평균 연봉값을 계산해보도록 한다.



    }
}
